# https://github.com/Automattic/node-canvas/issues/1065
brew "pixman"
brew "cairo"
brew "pango"
# brew "exa"
# brew "bitwarden-cli"
# brew "neovim"
brew "scrcpy"
brew "cmake" # run "sudo ln -s $(which cmake) /usr/local/bin/cmake"
brew "pkg-config" # run "sudo ln -s $(which pkg-config) /usr/local/bin/pkg-config"

tap "koekeishiya/formulae"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"

tap "mattisg/mattisg"
brew "mattisg/mattisg/adblock"

brew "golang-migrate"
brew "git-delta"
brew "git-lfs"
brew "ios-deploy"

tap "homebrew/cask-fonts"
cask "font-meslo-lg-nerd-font"

cask "betterdisplay"

cask "bitwarden"
cask "raycast"
cask "arc"
cask "utm"
cask "viscosity"
cask "vlc"
cask "xcodes"
cask "orbstack"
cask "keepassxc"
cask "joplin"
cask "battery"
cask "android-studio"
cask "virtualbuddy"
cask "timing"

# Backups
cask "duplicacy-cli"

# for abl
tap "lokalise/cli-2"
brew "lokalise2"

# cask "react-native-debugger"
# cask "figma"
cask "gimp"
cask "discord"
cask "imageoptim"
cask "insomnia"
# cask "slack"
cask "visual-studio-code"
cask "cleanshot"
cask "pixelsnap"
# cask "karabiner-elements"
cask "appcleaner"
# cask "ultimaker-cura"
# cask "brave-browser"
cask "gpg-suite"
# cask "kitty"
# cask "alfred"
cask "syncthing"
# cask "finicky" # cask "choosy"
cask "raycast"
cask "minisim" # launch ios/android simulator/emulators from the menu

# App Store 
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Bitwarden", id: 1352778147
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Quick Camera", id: 598853070
mas "Steam Link", id: 1246969117
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835

# visual studio code extensions
vscode "bierner.markdown-mermaid"
vscode "dbaeumer.vscode-eslint"
vscode "devicescript.devicescript-vscode"
vscode "dotjoshjohnson.xml"
vscode "esbenp.prettier-vscode"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "firsttris.vscode-jest-runner"
vscode "mathiasfrohlich.kotlin"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "orta.vscode-jest"
vscode "pflannery.vscode-versionlens"
vscode "redhat.vscode-xml"
vscode "rome.rome"
vscode "sainnhe.sonokai"
vscode "stylelint.vscode-stylelint"
vscode "tobermory.es6-string-html"
vscode "unifiedjs.vscode-mdx"
vscode "vscjava.vscode-gradle"
vscode "vscodevim.vim"
