brew "bat"
brew "fzf"
brew "scrcpy"
brew "tree"
brew "watchman"
brew "translate-shell"
brew "jq"
brew "wireguard-tools"
brew "fd"
brew "ripgrep"
brew "exa"
brew "node"
brew "golangci-lint"
brew "git-delta"
brew "gnupg"

cask "react-native-debugger"
cask "figma"
cask "gimp"
cask "discord"
cask "imageoptim"
cask "insomnia"
cask "slack"
cask "visual-studio-code"
cask "cleanshot"
cask "pixelsnap"
# cask "karabiner-elements"
cask "appcleaner"
cask "keyboard-maestro"
cask "netnewswire"
cask "startupizer"
cask "ultimaker-cura"
cask "brave-browser"
cask "gpg-suite"

tap "mattisg/mattisg"
brew "adblock"
