brew "bat"
brew "fzf"
brew "scrcpy"
brew "tree"
brew "watchman"
brew "translate-shell"
brew "jq"
brew "wireguard-tools"
brew "fd"
brew "ripgrep"
brew "exa"
brew "node"
brew "golangci-lint"
brew "git-delta"
brew "gnupg"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "mattisg/mattisg/adblock"
brew "imagemagick"
brew "pgformatter"
brew "pinentry-mac"
brew "golang-migrate"
brew "sqlparse" # sqlformat

cask "react-native-debugger"
cask "figma"
cask "gimp"
cask "discord"
cask "imageoptim"
cask "insomnia"
cask "slack"
cask "visual-studio-code"
cask "cleanshot"
cask "pixelsnap"
# cask "karabiner-elements"
cask "appcleaner"
cask "ultimaker-cura"
cask "brave-browser"
cask "gpg-suite"
cask "kitty"
cask "alfred"
cask "syncthing"
cask "choosy"

